Classes | Functions
API Infrastructure
General infrastructure-level components of the API. More...
 Classes
struct  | ACAPI::Error
Error type for ACAPI::Result containing an error message and an error code. More...
class  | ACAPI::Result< T, E >
Result is the standard return type of API functions. More...
class  | ACAPI::v1::Object
A base class for all ACAPI objects. Purely technical. More...
class  | ACAPI::v1::UniqueID
A unique identifier for API objects. It contains the GUID of the element and the Token of the AddOn which instantiated the element. More...
struct  | API_Guid
Represents a GS::Guid in the API layer. More...
struct  | NullValueType
Represents NullValueType in the API layer. More...
struct  | APIVariant< Types >
Represents a variant in the API layer. More...
struct  | APIOptional< T >
Represents an optional in the API layer. More...
 Functions
 constexpr API_Guid  | APINULLGuid ({})
Represents an empty API guid.
constexpr bool  | operator== (NullValueType, NullValueType)
compares NullValueTyp in the API layer.
Detailed Description
General infrastructure-level components of the API.
Function Documentation
◆ operator==()
 constexpr bool operator==  |  ( |  NullValueType  |  ,
|  NullValueType
)
constexpr
compares NullValueTyp in the API layer.
Since
Archicad 27